In [14]:
d={'a':20,'b':'w',1:15}

In [15]:
d

{'a': 20, 'b': 'w', 1: 15}

In [16]:
d1=d.copy() #method in dict,copies and assign to different memory

In [17]:
id(d)

2361838701248

In [18]:
id(d1)

2361838945600

In [19]:
d2=d.fromkeys('xyz')

In [7]:
print(d2)

{'x': None, 'y': None, 'z': None}

In [20]:
d3=d.fromkeys('ab')
print(d3)

{'a': None, 'b': None}

In [21]:
d2=d.fromkeys('xyz',15)

In [22]:
print(d2)

{'x': 15, 'y': 15, 'z': 15}

In [23]:
d2=d.fromkeys('xyz',15)

In [24]:
d={'a':20,'b':'w',1:15}

In [25]:
d.get('a')

20

In [26]:
d.get('c') #does not throw error

In [27]:
d['a']

20

In [28]:
d['c'] #throws error

KeyError: 'c'

In [29]:
d.items()

dict_items([('a', 20), ('b', 'w'), (1, 15)])

In [30]:
d.keys()

dict_keys(['a', 'b', 1])

In [31]:
d.pop('a') #requires 1 parameter that is the key

20

In [32]:
d

{'b': 'w', 1: 15}

In [33]:
d.popitem()

(1, 15)

In [34]:
d.popitem()

('b', 'w')

In [35]:
d

{}

In [44]:
d.popitem?
 #? gives information about any method

In [47]:
d.setdefault('x',10)

10

In [48]:
d

{'x': 10}

In [49]:
d1

{'a': 20, 'b': 'w', 1: 15}

In [50]:
d['a']='hello'

In [51]:
d

{'x': 10, 'a': 'hello'}

In [52]:
d1.update(d)

In [53]:
d

{'x': 10, 'a': 'hello'}

In [39]:
d1

{'a': 'hello', 'b': 'w', 1: 15, 'x': 10}

In [40]:
d.values()

dict_values([10, 'hello'])

In [41]:
def add():
    a=10
    b=20
    print(a+b)

In [42]:
add()

30

In [43]:
a #outside of fn no scope of it

NameError: name 'a' is not defined

In [44]:
def add(x,y):
    print(x+y)

In [45]:
add(10,15)

25

In [46]:
x=add(10,15)

25

In [47]:
print(x)

None

In [48]:
def add(x,y):
    return(x+y)

In [49]:
x=add(10,15)

In [50]:
print(x)

25

In [55]:
def add(x,y):
    return(x+y),x,(x-y)

In [56]:
x=add(10,15)

In [56]:
x #tuple

(25, 10, -5)

In [57]:
a,b,c=add(10,5)

In [58]:
a

15

In [59]:
b

10

In [60]:
c

5

In [1]:
def add(x,y):
    print(x,y)
    return x+y

In [3]:
add(x=5,y=12)

5 12

17

In [4]:
add(y=7,x=19)

19 7

26

In [5]:
add(3,y=4)

3 4

7

In [6]:
def add(x=5,y=10):
    print(x,y)
    return x+y

In [7]:
add()

5 10

15

In [8]:
add(5,10)

5 10

15

In [9]:
add(5,11)

5 11

16

In [10]:
add(6)

6 10

16

In [57]:
import pandas as pd

In [58]:
#1d series
#2d dataframes
l=[3,7,5]

In [59]:
pd.Series(l)

0    3
1    7
2    5
dtype: int64

In [61]:
s=pd.Series(l,index=['a','b','c'])
s#to label index

a    3
b    7
c    5
dtype: int64

In [20]:
s['a']

3

In [21]:
s[0]

3

In [22]:
l1=[1,2,3,4]

In [23]:
l2=[5,6,7,8]

In [24]:
s1=pd.Series(l1,index=['a','b','c','d'])

In [25]:
s2=pd.Series(l2,index=['c','d','e','f'])

In [26]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [27]:
s2

c    5
d    6
e    7
f    8
dtype: int64

In [28]:
s1+s2 #NaN not a number #converts into a float #arithmetic operation

a     NaN
b     NaN
c     8.0
d    10.0
e     NaN
f     NaN
dtype: float64

In [29]:
s1-s2

a    NaN
b    NaN
c   -2.0
d   -2.0
e    NaN
f    NaN
dtype: float64

In [30]:
s1*s2

a     NaN
b     NaN
c    15.0
d    24.0
e     NaN
f     NaN
dtype: float64

In [31]:
s1/s2

a         NaN
b         NaN
c    0.600000
d    0.666667
e         NaN
f         NaN
dtype: float64

In [67]:
l=[[1,2,3,],[4,5,6],[7,8,9]]

In [68]:
df=pd.DataFrame(l)

In [69]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [70]:
df=pd.DataFrame(l,index=['a','b','c'],columns=['w','x','y'])

In [71]:
df

   w  x  y
a  1  2  3
b  4  5  6
c  7  8  9

In [37]:
df['w']

a    1
b    4
c    7
Name: w, dtype: int64

In [74]:
df[['w','x']] #to print multiple column use a list

   w  x
a  1  2
b  4  5
c  7  8

In [56]:
df.loc['a'] #to print rows

w    1
x    2
y    3
Name: a, dtype: int64

In [58]:
df.iloc[0] #if using index number to print rows we use iloc

w    1
x    2
y    3
Name: a, dtype: int64

In [60]:
df.columns

Index(['w', 'x', 'y'], dtype='object')

In [61]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   w       3 non-null      int64
 1   x       3 non-null      int64
 2   y       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0+ bytes

In [64]:
df.describe()

         w    x    y
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [66]:
df['w']+df['y']

a     4
b    10
c    16
dtype: int64

In [69]:
type(df['w'])

pandas.core.series.Series

In [70]:
df['z']=df['w']+df['y']

In [71]:
df['z']

a     4
b    10
c    16
Name: z, dtype: int64

In [72]:
df

   w  x  y   z
a  1  2  3   4
b  4  5  6  10
c  7  8  9  16

In [73]:
df['p']=[22,5,12]

In [74]:
df

   w  x  y   z   p
a  1  2  3   4  22
b  4  5  6  10   5
c  7  8  9  16  12

In [75]:
df.loc['d']=[1,2,3,4,5]

In [76]:
df

   w  x  y   z   p
a  1  2  3   4  22
b  4  5  6  10   5
c  7  8  9  16  12
d  1  2  3   4   5

In [77]:
df.loc['e']=df.loc['a']+df.loc['b']

In [78]:
df

   w  x  y   z   p
a  1  2  3   4  22
b  4  5  6  10   5
c  7  8  9  16  12
d  1  2  3   4   5
e  5  7  9  14  27

In [79]:
df.mean()

w     3.6
x     4.8
y     6.0
z     9.6
p    14.2
dtype: float64

In [81]:
s.mean()

5.0

In [89]:
df['w'].mean() #to find a mean of a particular column

3.6

In [90]:
df.mean(axis=1) #to give mean of rows

a     6.4
b     6.0
c    10.4
d     3.0
e    12.4
dtype: float64

In [91]:
df.mean(axis=0) #to give mean of columns

w     3.6
x     4.8
y     6.0
z     9.6
p    14.2
dtype: float64

In [93]:
import numpy as np

In [94]:
d={'a':[4,3,6],
  'b':[2,np.nan,np.nan],
  'c':[5,3,np.nan]}

In [95]:
d

{'a': [4, 3, 6], 'b': [2, nan, nan], 'c': [5, 3, nan]}

In [96]:
d.values()

dict_values([[4, 3, 6], [2, nan, nan], [5, 3, nan]])

In [97]:
d.keys()

dict_keys(['a', 'b', 'c'])

In [99]:
df=pd.DataFrame(d)

In [100]:
df

   a    b    c
0  4  2.0  5.0
1  3  NaN  3.0
2  6  NaN  NaN

In [102]:
df.dropna() #removes any rows that has NaN #only gives ouput but in memory its same

   a    b    c
0  4  2.0  5.0

In [103]:
df

   a    b    c
0  4  2.0  5.0
1  3  NaN  3.0
2  6  NaN  NaN

In [104]:
df.fillna(5) #fills all nan with value passed in parameters

   a    b    c
0  4  2.0  5.0
1  3  5.0  3.0
2  6  5.0  5.0

In [105]:
df

   a    b    c
0  4  2.0  5.0
1  3  NaN  3.0
2  6  NaN  NaN

In [106]:
df['a'].fillna(df['a'].mean())

0    4
1    3
2    6
Name: a, dtype: int64

In [107]:
df

   a    b    c
0  4  2.0  5.0
1  3  NaN  3.0
2  6  NaN  NaN

In [108]:
df['b'].fillna(df['b'].mean()) #only temporary

0    2.0
1    2.0
2    2.0
Name: b, dtype: float64

In [109]:
df

   a    b    c
0  4  2.0  5.0
1  3  NaN  3.0
2  6  NaN  NaN

In [112]:
df['b'].fillna(df['b'].mean(),inplace=True) #inplace=True will make the change permanent

In [111]:
df

   a    b    c
0  4  2.0  5.0
1  3  2.0  3.0
2  6  2.0  NaN